{"systemSettings":{"recaptchaEnabled":false,"recaptchaSiteKey":"6LeWfG4rAAAAADZOrjPAF3hhnQaouunJkyVIWRY8","recaptchaSecretKey":"6LeWfG4rAAAAAJyMavGX0PQZ75GmpRTMVQ-UaeSu"},"walletConfig":{},"welcomePageTemplate":{"title":"🎉 Welcome to TradePilot AI!","text":"Your account is ready and the future of automated trading is at your fingertips.\n\nWe're thrilled to have you onboard. Please check your inbox for a quick start guide and important information about your new account.\n\nLet's start your journey to passive income!","imageUrl":"/api/storage/media/welcome_page/image_1762124098075.jpeg","videoUrl":""},"welcomeInboxTemplate":{"title":"🚀 Your Trading Journey Begins Now!","text":"Hello and welcome to TradePilot AI!\n\nWe are excited to have you with us. Your account has been successfully created.\n\nHere are a few quick steps to get started:\n1.  **Fund Your Account:** Go to the 'Deposit' section to add funds.\n2.  **Choose Your AI:** Visit the 'AI Trading Plans' to select and activate your bot.\n3.  **Watch it Grow:** Monitor your progress from your dashboard.\n\nIf you have any questions, our support team is ready to assist you.\n\nHappy trading!\n- The TradePilot AI Team","imageUrl":"","videoUrl":"","videoEmbedHtml":"<div style=\"position:relative; width:100%; height:0px; padding-bottom:148.333%\"><iframe allow=\"fullscreen;autoplay\" allowfullscreen height=\"100%\" src=\"https://streamable.com/e/jggulb?autoplay=1\" width=\"100%\" style=\"border:none; width:100%; height:100%; position:absolute; left:0px; top:0px; overflow:hidden;\"></iframe></div>"},"chatbotSettings":{"personality":"You are TradePilot AI, a friendly and professional crypto trading assistant. You are knowledgeable about cryptocurrency, arbitrage, and the features of the TradePilot AI platform. Keep your answers concise, helpful, and optimistic. Do not give financial advice. Always promote the platform's features when relevant.","apiKeys":[{"key":"csk-fj5hkkykwtnnttrxj35nvrx5498drpnpjvwhr2yet36k6mte","status":"active","usageCount":4,"lastUsed":"2025-11-03T14:48:07.997Z"},{"key":"csk-pddjmh5wfv25dpwj6fxxn9kmmr26dcp55w29vv9rhx2xxdfr","status":"failed","usageCount":0,"lastUsed":"2025-11-03T14:19:54.716Z"},{"key":"csk-k5mmn46rfjd6vhkxdwh69d3rxejhp86f9mxd2f39jrjkr33p","status":"failed","usageCount":0,"lastUsed":"2025-11-03T14:19:55.640Z"}],"iconText":"TradePilot AI"},"testimonials":[{"id":"rev-1755269735694-0","name":"William Anderson","text":"Honestly, I was skeptical at first. But after three months of using TradePilot, I'm genuinely impressed. The bot found opportunities I never would have spotted manually, and my portfolio has grown consistently. The interface is clean and doesn't overwhelm you with unnecessary data. Highly recommend giving it a shot!","rating":4,"createdAt":"2025-08-15T14:55:35.694Z"},{"id":"rev-1755238128369-1","name":"Emma Jones","text":"This platform changed my approach to crypto entirely. I used to spend hours analyzing charts and still missed most arbitrage windows. Now the AI handles everything while I focus on my day job. The returns aren't crazy overnight gains, but they're steady and reliable, which is exactly what I wanted.","rating":4,"createdAt":"2025-08-15T06:08:48.369Z","adminReply":"Thank you for sharing your experience! We're thrilled the platform is working well for you.","adminReplyAt":"2025-08-20T01:36:07.735Z"},{"id":"rev-1760369862909-2","name":"Henry Jackson","text":"Been trading crypto for years, tried several bots before this one. TradePilot is different - the execution speed is incredible and I can actually see each trade happening in real-time. No black box nonsense. Started with a small amount to test, now I've significantly increased my investment.","rating":5,"createdAt":"2025-10-13T15:37:42.909Z","adminReply":"That's wonderful to hear! We're committed to delivering consistent results for all our users.","adminReplyAt":"2025-10-15T04:20:54.436Z"},{"id":"rev-1756110528814-3","name":"Avery King","text":"As someone who works full-time and has a family, I needed something automated that actually works. TradePilot delivers. Set it up in under 10 minutes, and it's been running smoothly for months. The profits aren't huge every day, but they add up fast. Worth every penny.","rating":5,"createdAt":"2025-08-25T08:28:48.814Z"},{"id":"rev-1757661747002-4","name":"Robert Green","text":"The transparency here is what won me over. You can literally track every single trade the AI makes, see the profit margins, understand the strategy. It's not just a magic money printer - it's a sophisticated tool that you can learn from. My only regret? Not starting sooner.","rating":5,"createdAt":"2025-09-12T07:22:27.002Z"}]}